CSI API ETABS v1

# cPropMaterialTimeDep Property

---

API calls for time dependent material properties.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPropMaterialTD TimeDep { get; }

    ReadOnly Property TimeDep As cPropMaterialTD
    	Get

    Dim instance As cPropMaterial
    Dim value As cPropMaterialTD

    value = instance.TimeDep

    property cPropMaterialTD^ TimeDep {
    	cPropMaterialTD^ get ();
    }

    abstract TimeDep : cPropMaterialTD with get

#### Property Value

Type: cPropMaterialTD

See Also

#### Reference

cPropMaterial Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com